tutorials/scalarTransportFoam/complexWaves/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upperWall
    {
        type            cyclic;
        nFaces          200;
        startFace       79600;
                        matchTolerance  0.0001;
        neighbourPatch  lowerWall;
    }
    lowerWall
    {
       type            cyclic;
        nFaces          200;
        startFace       79800;
                   matchTolerance  0.0001;
        neighbourPatch  upperWall;
    }
    rightWall
    {
      type            cyclic;
        nFaces          200;
        startFace       80000;
            matchTolerance  0.0001;
        neighbourPatch  leftWall;
    }
    leftWall
    {
        type            cyclic;
        nFaces          200;
        startFace       80200;
              matchTolerance  0.0001;
        neighbourPatch  rightWall;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
